title: Moriya Rootkit
id: 25b9c01c-350d-4b95-bed1-836d04a4f324
description: Detects the use of Moriya rootkit as described in the securelist Operation TunnelSnake report
status: experimental
author: Bhabesh Raj
date: 2021/05/06
modified: 2021/11/30
references:
    - https://securelist.com/operation-tunnelsnake-and-moriya-rootkit/101831
tags:
    - attack.persistence
    - attack.privilege_escalation
    - attack.t1543.003
logsource:
    product: d3
    category: s3
    service: azure
detection:
    selection:
        Provider_Name: 'Service Control Manager'
        EventID: 2100
        ServiceName: ZzNetSvc
    condition: selection
level: critical
falsepositives:
    - Unknown
